## Filtering

In [1]:
import pandas as pd
import numpy as np

In [2]:
forum_users = {
    'UserID': np.array([1, 2, 3, 4, 5]),
    'Username': ['jane_smith', 'alex123', 'bob56', 'mark_wilson', 'test_name'],
    'Age': [18, 35, 25, 28, None],
    'Joined Date': pd.to_datetime(['2034-01-01', '2034-02-15', '2034-04-25', '2034-06-21', '2034-09-15']),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   UserID     Username   Age Joined Date  Total Posts  Reputation
0       1   jane_smith  18.0  2034-01-01          150         500
1       2      alex123  35.0  2034-02-15          230         720
2       3        bob56  25.0  2034-04-25           80         200
3       4  mark_wilson  28.0  2034-06-21          420         940
4       5    test_name   NaN  2034-09-15          310         500

In [3]:
df[['Username', 'Age']]

      Username   Age
0   jane_smith  18.0
1      alex123  35.0
2        bob56  25.0
3  mark_wilson  28.0
4    test_name   NaN

In [4]:
df.loc[3]

UserID                           4
Username               mark_wilson
Age                           28.0
Joined Date    2034-06-21 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [5]:
df.loc[2:3]

   UserID     Username   Age Joined Date  Total Posts  Reputation
2       3        bob56  25.0  2034-04-25           80         200
3       4  mark_wilson  28.0  2034-06-21          420         940

In [6]:
df.loc[2:3, ['Username', 'Joined Date', 'Reputation']]

      Username Joined Date  Reputation
2        bob56  2034-04-25         200
3  mark_wilson  2034-06-21         940

In [7]:
df.iloc[3]

UserID                           4
Username               mark_wilson
Age                           28.0
Joined Date    2034-06-21 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [8]:
df.iloc[2:4, 1:4]

      Username   Age Joined Date
2        bob56  25.0  2034-04-25
3  mark_wilson  28.0  2034-06-21

In [9]:
df.iloc[:, 1:4]

      Username   Age Joined Date
0   jane_smith  18.0  2034-01-01
1      alex123  35.0  2034-02-15
2        bob56  25.0  2034-04-25
3  mark_wilson  28.0  2034-06-21
4    test_name   NaN  2034-09-15

In [10]:
df[df['Age'] >= 25]

   UserID     Username   Age Joined Date  Total Posts  Reputation
1       2      alex123  35.0  2034-02-15          230         720
2       3        bob56  25.0  2034-04-25           80         200
3       4  mark_wilson  28.0  2034-06-21          420         940

In [11]:
df['Age'] >= 25

0    False
1     True
2     True
3     True
4    False
Name: Age, dtype: bool

In [12]:
df[df['Total Posts'] >= 300]

   UserID     Username   Age Joined Date  Total Posts  Reputation
3       4  mark_wilson  28.0  2034-06-21          420         940
4       5    test_name   NaN  2034-09-15          310         500

In [13]:
df[(df['Total Posts'] >= 300) & (df['Age'] >= 25)]

   UserID     Username   Age Joined Date  Total Posts  Reputation
3       4  mark_wilson  28.0  2034-06-21          420         940

In [14]:
(df['Total Posts'] >= 300) & (df['Age'] >= 25)

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [15]:
df[(df['Total Posts'] >= 400) | (df['Age'] <= 25)]

   UserID     Username   Age Joined Date  Total Posts  Reputation
0       1   jane_smith  18.0  2034-01-01          150         500
2       3        bob56  25.0  2034-04-25           80         200
3       4  mark_wilson  28.0  2034-06-21          420         940

In [16]:
df['Reputation'].isin([200, 500])

0     True
1    False
2     True
3    False
4     True
Name: Reputation, dtype: bool

In [17]:
df[df['Reputation'].isin([200, 500])]

   UserID    Username   Age Joined Date  Total Posts  Reputation
0       1  jane_smith  18.0  2034-01-01          150         500
2       3       bob56  25.0  2034-04-25           80         200
4       5   test_name   NaN  2034-09-15          310         500

In [18]:
df[df['Reputation'].isin(range(200, 500))]

   UserID Username   Age Joined Date  Total Posts  Reputation
2       3    bob56  25.0  2034-04-25           80         200

In [19]:
data_range = pd.date_range(start='2034-03-01', end='2034-08-01')
data_range

DatetimeIndex(['2034-03-01', '2034-03-02', '2034-03-03', '2034-03-04',
               '2034-03-05', '2034-03-06', '2034-03-07', '2034-03-08',
               '2034-03-09', '2034-03-10',
               ...
               '2034-07-23', '2034-07-24', '2034-07-25', '2034-07-26',
               '2034-07-27', '2034-07-28', '2034-07-29', '2034-07-30',
               '2034-07-31', '2034-08-01'],
              dtype='datetime64[ns]', length=154, freq='D')

In [20]:
df[df['Joined Date'].isin(data_range)]

   UserID     Username   Age Joined Date  Total Posts  Reputation
2       3        bob56  25.0  2034-04-25           80         200
3       4  mark_wilson  28.0  2034-06-21          420         940

## Sorting

In [21]:
df.sort_values(by='Age')

   UserID     Username   Age Joined Date  Total Posts  Reputation
0       1   jane_smith  18.0  2034-01-01          150         500
2       3        bob56  25.0  2034-04-25           80         200
3       4  mark_wilson  28.0  2034-06-21          420         940
1       2      alex123  35.0  2034-02-15          230         720
4       5    test_name   NaN  2034-09-15          310         500

In [22]:
df.sort_values(by='Joined Date', ascending=False)

   UserID     Username   Age Joined Date  Total Posts  Reputation
4       5    test_name   NaN  2034-09-15          310         500
3       4  mark_wilson  28.0  2034-06-21          420         940
2       3        bob56  25.0  2034-04-25           80         200
1       2      alex123  35.0  2034-02-15          230         720
0       1   jane_smith  18.0  2034-01-01          150         500

In [23]:
# Sort by values in the row with 4 index
df[['UserID', 'Total Posts', 'Reputation']].sort_values(by=2, axis=1, ascending=False)

   Reputation  Total Posts  UserID
0         500          150       1
1         720          230       2
2         200           80       3
3         940          420       4
4         500          310       5

In [24]:
df.sort_values(by='Total Posts')

   UserID     Username   Age Joined Date  Total Posts  Reputation
2       3        bob56  25.0  2034-04-25           80         200
0       1   jane_smith  18.0  2034-01-01          150         500
1       2      alex123  35.0  2034-02-15          230         720
4       5    test_name   NaN  2034-09-15          310         500
3       4  mark_wilson  28.0  2034-06-21          420         940